import getInsertedDate from './index'

describe('二分查找测试', () => {
    const dateArr = ['2022-12-06', '2022-12-07', '2022-12-10', '2022-12-11', '2022-12-12']
    test('测试用例1', () => {
        expect(getInsertedDate(dateArr, '2022-12-08')).
            toStrictEqual(['2022-12-06', '2022-12-07', '2022-12-08', '2022-12-10', '2022-12-11', '2022-12-12'])
    })

    test('测试用例2', () => {
        expect(getInsertedDate(dateArr, '2022-12-13')).
            toStrictEqual(['2022-12-06', '2022-12-07', '2022-12-10', '2022-12-11', '2022-12-12', '2022-12-13'])
    })

    test('测试用例2', () => {
        expect(getInsertedDate(dateArr, '2022-12-04')).
            toStrictEqual(['2022-12-04', '2022-12-06', '2022-12-07', '2022-12-10', '2022-12-11', '2022-12-12'])
    })
})